[
    {
        "categoryName": "What",
        "questions": [
            {
                "title": "Where is the data for the game from?",
                "text": "I got a lot of the data from Wikipedia, things like the names, ages, time in the house. Then I added the instagram data myself, using the incredibly helpful www.terracehousesocial.com for links to almost everyone's social media pages. For dates I re-watched and updated a spreadsheet as I went. Most of the data should be good but if you do notice something that doesn't seem right please do reach out.",
                "hidden": false
            },
            {
                "title": "Why did you make the game?",
                "text": "I'm fresh out of a coding bootcamp and I wanted to work on a full stack project, I also wanted to make a project that I could share with a community. This project was mainly an excuse to learn Typescript though.",
                "hidden": false
            },
            {
                "title": "What tech is the site build with?",
                "text": "The front end is Reach with Typescript. The backend is a Node/express server and a Postgres database.Lots of other bits and libraries, but if you like that kind of thing you can pull down the repo and take a look, links are at the top of the page.",
                "hidden": false
            },
            {
                "title": "How can I contribute?",
                "text": "Lots of ways! Ideas, data collection, reporting bugs and issues, fixing bugs and issues 👀. All and any help is greatly appreciated.",
                "hidden": false
            },
            {
                "title": "What is a 'date' in the game sense.",
                "text": "A date is any premeditated outing based the people involved being interested in each other. So Shion and Tsubasa ice skating is a date. Two housemates going for an impromptu lunch is not a date.",
                "hidden": false
            },
            {
                "title": "Whats next for the project?",
                "text": "I'm not sure, fixing any issues anyone finds, updating it when a new season has come out 🙏🏻. I'd love to work on it more though. I have some half baked ideas about incorporating the panel, special guests and classic music tracks as some kind of 'bonus rounds' but if anyone has any ideas please do get in touch.",
                "hidden": false
            },
            {
                "title": "How much did you want to see it, on a scale of 1 to 10?",
                "text": "2",
                "hidden": false
            },
            {
                "title": "How much did you want to go?",
                "text": "1",
                "hidden": false
            },
            {
                "title": "Do you practice Santeria?",
                "text": "No.",
                "hidden": false
            },
            {
                "title": "What's the best season of Terrace House?",
                "text": "Easy, Boys & Girls Next Door.",
                "hidden": false
            }
        ]
    }
]
